'''names = ('Максат','Лязат','Данияр','Айбек','Атай','Салават','Адинай','Жоомарт','Алымбек','Эрмек','Дастан','Бекмамат','Аслан',)
i = 2
while i < 12:
    print(names)
    i+=2






'''

a = int(input("введите число")
while a <= 100:
    if (a > 100) and (a < 1000):
        print("это число трёхзначное")
    else:
        print("не трёхзначное")
if a > 0:
    print("положительное число")
else:
    print("отрицательная")
if a % 2 == 0:
    print("четное")
else:
    print("не четное")
if a%31 == 0:
    print("делится")
else:
    print("не делиится")
break
    print(a)

'''

i = -100
for i in range(i,100):
    if i < 100: 
        print(i)
        i+=1

'''












